<template>
  <div class="page">
    <h3>
      秋节在各地虽然发展出不同习俗，但有些习俗是各地皆有的。赏月是各地中秋节的传统活动之一，《礼记》早有记载“秋暮夕月”，意为拜祭月神，逢此时则要举行迎寒和祭月，设香案。至唐宋时期，赏月之风更盛。也有祭月的仪式。中秋节也是一家团圆的日子，人们都会回到家中一起吃饭、团聚，并且会祭祖，感谢祖先庇佑。也会吃特定的食品，不少都与月亮、团圆有关，这些食品同时也是祭月的祭品，如华人（汉族）都有吃月饼的习俗[3]，日本人（大和族）则会吃月见团子，部分地区会煎太阳蛋，月饼、月光饼、月见团子、太阳蛋都呈圆形，代表满月，朝鲜族所吃的是半月形的松片，象征月亮由亏转盈。此外，时令的水果和其他农作物如杨桃、柚子、芋头、栗子、菱角、梨子、柿子等，在农耕社会中是农民秋季的收获，也是中秋节的食品和祭品。

      中国南方和越南还有提灯笼的习俗，有些地区还会举办大型的彩灯会。这个习俗也随着早期移民南下而流传到新加坡、马来西亚等东南亚华人地区。

      中秋节也是桂花盛开的时节，赏桂花、食用桂花制作的各种食品也是中秋节的常见习俗，以糕点、糖果最为多见。

    </h3>
    <button @click="forward">go next page</button>
    <input />
    <button @click="back">go back</button>
    <h3>
      秋节在各地虽然发展出不同习俗，但有些习俗是各地皆有的。赏月是各地中秋节的传统活动之一，《礼记》早有记载“秋暮夕月”，意为拜祭月神，逢此时则要举行迎寒和祭月，设香案。至唐宋时期，赏月之风更盛。也有祭月的仪式。中秋节也是一家团圆的日子，人们都会回到家中一起吃饭、团聚，并且会祭祖，感谢祖先庇佑。也会吃特定的食品，不少都与月亮、团圆有关，这些食品同时也是祭月的祭品，如华人（汉族）都有吃月饼的习俗[3]，日本人（大和族）则会吃月见团子，部分地区会煎太阳蛋，月饼、月光饼、月见团子、太阳蛋都呈圆形，代表满月，朝鲜族所吃的是半月形的松片，象征月亮由亏转盈。此外，时令的水果和其他农作物如杨桃、柚子、芋头、栗子、菱角、梨子、柿子等，在农耕社会中是农民秋季的收获，也是中秋节的食品和祭品。

      中国南方和越南还有提灯笼的习俗，有些地区还会举办大型的彩灯会。这个习俗也随着早期移民南下而流传到新加坡、马来西亚等东南亚华人地区。

      中秋节也是桂花盛开的时节，赏桂花、食用桂花制作的各种食品也是中秋节的常见习俗，以糕点、糖果最为多见。

    </h3>
  </div>
</template>

<script lang="ts">
import { Options, Vue } from 'vue-class-component';
import router from '@/router';

@Options({
  methods: {
    forward() {
      router.push('/p3')
    },
    back() {
      router.go(-1)
    }
  }
})
export default class HomeView extends Vue { }
</script>

<style scoped>
.page {
  display: flex;
  flex-direction: column;
  align-content: center;
  height: 100vh;
  overflow: scroll;
  text-align: center;
  background: orange;
}
</style>